
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда 
		Возврат;
	КонецЕсли;
	
	Дата                        = Параметры.Дата;
	ИмяПользователя             = Параметры.ИмяПользователя;
	ПредставлениеПриложения     = Параметры.ПредставлениеПриложения;
	Компьютер                   = Параметры.Компьютер;
	Событие                     = Параметры.Событие;
	ПредставлениеСобытия        = Параметры.ПредставлениеСобытия;
	Комментарий                 = Параметры.Комментарий;
	ПредставлениеМетаданных     = Параметры.ПредставлениеМетаданных;
	Данные                      = Параметры.Данные;
	ПредставлениеДанных         = Параметры.ПредставлениеДанных;
	Транзакция                  = Параметры.Транзакция;
	СтатусТранзакции            = Параметры.СтатусТранзакции;
	Сеанс                       = Параметры.Сеанс;
	РабочийСервер               = Параметры.РабочийСервер;
	ОсновнойIPПорт              = Параметры.ОсновнойIPПорт;
	ВспомогательныйIPПорт       = Параметры.ВспомогательныйIPПорт;
	
	Если Параметры.Свойство("РазделениеДанныхСеанса") Тогда
		РазделениеДанныхСеанса = Параметры.РазделениеДанныхСеанса;
	КонецЕсли;
	
	Если ТипЗнч(ПредставлениеМетаданных) = Тип("СписокЗначений") Тогда
		Элементы.ПредставлениеМетаданных.КнопкаОткрытия = Истина;
		Элементы.ПредставлениеМетаданныхДоступа.КнопкаОткрытия = Истина;
		Элементы.ПредставлениеМетаданныхОтказаПраваДоступа.КнопкаОткрытия = Истина;
		Элементы.ПредставлениеМетаданныхОтказаДействияДоступа.КнопкаОткрытия = Истина;
	КонецЕсли;
	
	Элементы.ДанныеДоступа.Видимость = Ложь;
	Элементы.ДанныеОтказаПраваДоступа.Видимость = Ложь;
	Элементы.ДанныеОтказаДействияДоступа.Видимость = Ложь;
	Элементы.ДанныеАутентификации.Видимость = Ложь;
	Элементы.ДанныеПользователяИБ.Видимость = Ложь;
	Элементы.ПростыеДанные.Видимость = Ложь;
	Элементы.ДанныеИзменениеРасширенияКонфигурации.Видимость = Ложь;
	Элементы.ДанныеИзменениеНастроекЖурналаРегистрации.Видимость = Ложь;
	Элементы.ПредставленияДанных.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если Событие = "Доступ. Доступ" Тогда
		Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеДоступа;
		Элементы.ДанныеДоступа.Видимость = Истина;
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		Если ДанныеСобытия <> Неопределено Тогда
			СоздатьТаблицуФормы("ТаблицаДанныхДоступа", "ТаблицаДанных", ДанныеСобытия);
		КонецЕсли;
		Элементы.Комментарий.РастягиватьПоВертикали = Ложь;
		Элементы.Комментарий.Высота = 1;
		
	ИначеЕсли Событие = "Доступ. Отказ в доступе" Тогда
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		
		Если ДанныеСобытия <> Неопределено Тогда
			Если ДанныеСобытия.Свойство("Право") Тогда
				Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеОтказаПраваДоступа;
				Элементы.ДанныеОтказаПраваДоступа.Видимость = Истина;
				ОтказПраваДоступа = ДанныеСобытия.Право;
			Иначе
				Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеОтказаДействияДоступа;
				Элементы.ДанныеОтказаДействияДоступа.Видимость = Истина;
				ОтказДействияДоступа = ДанныеСобытия.Действие;
				СоздатьТаблицуФормы("ТаблицаДанныхОтказаДействияДоступа", "ТаблицаДанных", ДанныеСобытия.Данные);
				Элементы.Комментарий.РастягиватьПоВертикали = Ложь;
				Элементы.Комментарий.Высота = 1;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Событие = "Сеанс. Аутентификация"
		ИЛИ Событие = "Сеанс. Ошибка аутентификации" Тогда
		
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеАутентификации;
		Элементы.ДанныеАутентификации.Видимость = Истина;
		Если ДанныеСобытия <> Неопределено Тогда
			ДанныеСобытия.Свойство("Имя",                   АутентификацияИмяПользователя);
			ДанныеСобытия.Свойство("ПользовательОС",        АутентификацияПользовательОС);
			ДанныеСобытия.Свойство("ТекущийПользовательОС", АутентификацияТекущийПользовательОС);
		КонецЕсли;
		
	ИначеЕсли Событие = "Пользователи. Удаление"
		ИЛИ Событие = "Пользователи. Добавление"
		ИЛИ Событие = "Пользователи. Изменение"
		ИЛИ Событие = "Пользователи. Ошибка добавления" Тогда
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеПользователяИБ;
		Элементы.ДанныеПользователяИБ.Видимость = Истина;
		СвойстваПользователяИБ = Новый ТаблицаЗначений;
		СвойстваПользователяИБ.Колонки.Добавить("Имя");
		СвойстваПользователяИБ.Колонки.Добавить("Значение");
		МассивРолей = Неопределено;
		Если ДанныеСобытия <> Неопределено Тогда
			Для каждого КлючИЗначение Из ДанныеСобытия Цикл
				Если КлючИЗначение.Ключ = "Роли" Тогда					
					МассивРолей = КлючИЗначение.Значение;
					Продолжить;
				КонецЕсли;
				НоваяСтрока = СвойстваПользователяИБ.Добавить();
				НоваяСтрока.Имя      = КлючИЗначение.Ключ;
				НоваяСтрока.Значение = КлючИЗначение.Значение;
			КонецЦикла;
		КонецЕсли;
		СоздатьТаблицуФормы("ТаблицаСвойствПользователяИБ", "ТаблицаДанных", СвойстваПользователяИБ);
		Если ЗначениеЗаполнено(МассивРолей) Тогда
			РасшифрованныеРоли = РасшифроватьРолиСредствами1С();
			Если ЗначениеЗаполнено(РасшифрованныеРоли) Тогда
				МассивРолей = РасшифрованныеРоли;
			Иначе
				Элементы.РасшифроватьРоли.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		Если МассивРолей <> Неопределено Тогда
			РолиПользователяИБ = Новый ТаблицаЗначений;
			РолиПользователяИБ.Колонки.Добавить("Роль",, НСтр("ru = 'Роль'"));
			Для каждого ТекущаяРоль Из МассивРолей Цикл
				РолиПользователяИБ.Добавить().Роль = ТекущаяРоль;
			КонецЦикла;
			СоздатьТаблицуФормы("ТаблицаРолейПользователяИБ", "Роли", РолиПользователяИБ);
		КонецЕсли;
		Элементы.Комментарий.РастягиватьПоВертикали = Ложь;
		Элементы.Комментарий.Высота = 1;
		
	ИначеЕсли Событие = "Данные. Инициализация предопределенных данных"   Тогда
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеПользователяИБ;
		Элементы.ДанныеПользователяИБ.Видимость = Истина;
		СвойстваПользователяИБ = Новый ТаблицаЗначений;
		СвойстваПользователяИБ.Колонки.Добавить("ИмяПредопределенныхДанных");
		Для каждого стр Из ДанныеСобытия Цикл
			НоваяСтрока = СвойстваПользователяИБ.Добавить();
			НоваяСтрока.ИмяПредопределенныхДанных = стр.ИмяПредопределенныхДанных;
		КонецЦикла;	
		СоздатьТаблицуФормы("ТаблицаСвойствПользователяИБ", "ТаблицаДанных", СвойстваПользователяИБ);
		Элементы.ТаблицаСвойствПользователяИБ.Заголовок = "ИмяПредопределенныхДанных";
				
	ИначеЕсли Событие = "Информационная база. Изменение расширения конфигурации" Тогда 
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеИзменениеРасширенияКонфигурации;
		Элементы.ДанныеИзменениеРасширенияКонфигурации.Видимость = Истина;
		Если ДанныеСобытия <> Неопределено Тогда
			СвойстваИзмененияРасширения = Новый ТаблицаЗначений;
			СвойстваИзмененияРасширения.Колонки.Добавить("Ключ");
			СвойстваИзмененияРасширения.Колонки.Добавить("Значение");
			Для каждого СтрокаДанных из ДанныеСобытия Цикл
				НоваяСтрока = СвойстваИзмененияРасширения.Добавить();
				НоваяСтрока.Ключ = СтрокаДанных.Ключ;
				НоваяСтрока.Значение = СтрокаДанных.Значение;
			КонецЦикла;	
			СоздатьТаблицуФормы("ТаблицаСвойствИзмененияРасширения", "ТаблицаДанных", СвойстваИзмененияРасширения);
			Элементы.Комментарий.РастягиватьПоВертикали = Ложь;
			Элементы.Комментарий.Высота = 1;
			
		КонецЕсли;
	ИначеЕсли Событие = "Информационная база. Изменение параметров журнала регистрации" Тогда 
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеИзменениеНастроекЖурналаРегистрации;
		Элементы.ДанныеИзменениеНастроекЖурналаРегистрации.Видимость = Истина;
		Если ДанныеСобытия <> Неопределено Тогда
			ИзменениеНастроекЖурналаРегистрации = Новый ТаблицаЗначений;
			ИзменениеНастроекЖурналаРегистрации.Колонки.Добавить("Ключ");
			ИзменениеНастроекЖурналаРегистрации.Колонки.Добавить("Значение");
			Для каждого СтрокаДанных из ДанныеСобытия Цикл
				НоваяСтрока = ИзменениеНастроекЖурналаРегистрации.Добавить();
				Если СтрокаДанных.Ключ = "УровеньСобытийЖурналаРегистрации" Тогда
					НоваяСтрока.Ключ = "Уровень событий журнала регистрации";	
				ИначеЕсли СтрокаДанных.Ключ = "ПериодРазделенияЖурналаРегистрации" Тогда	
					НоваяСтрока.Ключ = "Период разделения журнала регистрации";	
				ИначеЕсли СтрокаДанных.Ключ = "ФорматЖурналаРегистрации" Тогда	
					НоваяСтрока.Ключ = "Формат журнала регистрации";	
				Иначе	
					НоваяСтрока.Ключ = СтрокаДанных.Ключ;
				КонецЕсли;
				НоваяСтрока.Значение = СтрокаДанных.Значение;
			КонецЦикла;	
			СоздатьТаблицуФормы("ТаблицаСвойствИзменениеНастроекЖурналаРегистрации", "ТаблицаДанных", ИзменениеНастроекЖурналаРегистрации);
			Элементы.Комментарий.РастягиватьПоВертикали = Ложь;
			Элементы.Комментарий.Высота = 1;
			
		КонецЕсли;
		
	ИначеЕсли Событие = "Информационная база. Обновление предопределенных данных" Тогда
		ДанныеСобытия = ПолучитьДанныеXML(Параметры.АдресДанных);
		Если ТипЗнч(ДанныеСобытия) = Тип("ТаблицаЗначений") Тогда
			Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ДанныеИБОбновлениеПредопределенныхДанных;
			Элементы.ДанныеИБОбновлениеПредопределенныхДанных.Видимость = Истина;
			СоздатьТаблицуФормы("ТаблицаИБОбновлениеПредопределенныхДанных", "ТаблицаДанных", ДанныеСобытия);
		Иначе
			Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ПростыеДанные;
			Элементы.ПростыеДанные.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ПредставленияДанных.ТекущаяСтраница = Элементы.ПростыеДанные;
		Элементы.ПростыеДанные.Видимость = Истина;
	КонецЕсли;
	
	Элементы.РазделениеДанныхСеанса.Видимость = Ложь;
	
	УстановитьОтображениеЗаголовковГрупп(ЭтаФорма, "ГруппаДанные, ГруппаСобытие, ГруппаСоединение, ГруппаТранзакция");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеXML(ВходящаяСтрока)
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(ВходящаяСтрока);
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

&НаСервере
Процедура УстановитьОтображениеЗаголовковГрупп(Форма, ИменаГрупп = "") Экспорт
	
	Если ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		ЖирныйШрифт = Новый Шрифт(,, Истина);
		Если НЕ ЗначениеЗаполнено(ИменаГрупп) Тогда 
			Для Каждого Элемент Из Форма.Элементы Цикл 
				Если Тип(Элемент) = Тип("ГруппаФормы")
					И Элемент.Вид = ВидГруппыФормы.ОбычнаяГруппа
					И Элемент.ОтображатьЗаголовок = Истина 
					И (Элемент.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение
					Или Элемент.Отображение = ОтображениеОбычнойГруппы.Нет) Тогда 
					Элемент.ШрифтЗаголовка = ЖирныйШрифт;
				КонецЕсли;
			КонецЦикла;
		Иначе
			МассивЗаголовков = РазложитьСтрокуВМассивПодстрок(ИменаГрупп,,, Истина);
			Для Каждого ИмяЗаголовка Из МассивЗаголовков Цикл
				Элемент = Форма.Элементы[ИмяЗаголовка];
				Если Элемент.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение ИЛИ Элемент.Отображение = ОтображениеОбычнойГруппы.Нет Тогда 
					Элемент.ШрифтЗаголовка = ЖирныйШрифт;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Процедура ПредставлениеМетаданныхОткрытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьЗначение(, ПредставлениеМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделениеДанныхСеансаОткрытие(Элемент, СтандартнаяОбработка)
	
	ПоказатьЗначение(, РазделениеДанныхСеанса);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элемент.ТекущиеДанные[Сред(Поле.Имя, СтрДлина(Элемент.Имя)+1)]);
	
КонецПроцедуры

Процедура СоздатьТаблицуФормы(Знач ИмяПоляТаблицыФормы, Знач ИмяРеквизитаДанныеФормыКоллекция, Знач ТаблицаЗначений)
	
	Если ТипЗнч(ТаблицаЗначений) <> Тип("ТаблицаЗначений") Тогда
		ТаблицаЗначений = Новый ТаблицаЗначений;
		ТаблицаЗначений.Колонки.Добавить("Неопределено", , " ");
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяРеквизитаДанныеФормыКоллекция, Колонка.Заголовок));
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		ЭлементРеквизита = Элементы.Добавить(ИмяПоляТаблицыФормы + Колонка.Имя, Тип("ПолеФормы"), Элементы[ИмяПоляТаблицыФормы]);
		ЭлементРеквизита.ПутьКДанным = ИмяРеквизитаДанныеФормыКоллекция + "." + Колонка.Имя;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаЗначений, ИмяРеквизитаДанныеФормыКоллекция);
	
КонецПроцедуры

&НаСервере
Функция РасшифроватьРолиСредствами1С()
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала",ЭтаФорма.Дата);
	Отбор.Вставить("ДатаОкончания",ЭтаФорма.Дата);
	МассивСобытий = Новый Массив;
	МассивПользователей = Новый Массив;
	МассивСеансов = Новый Массив;
	Если ЭтаФорма.ПредставлениеСобытия = "Пользователи. Изменение" 
		ИЛИ ЭтаФорма.ПредставлениеСобытия = "_$User$_.Update" Тогда
		МассивСобытий.Добавить("_$User$_.Update");		
	Иначе	
		МассивСобытий.Добавить("_$User$_.New");
	КонецЕсли;
	Если ЗначениеЗаполнено(ЭтаФорма.ИмяПользователя) 
		И ЭтаФорма.ИмяПользователя <> "<Не указан>" 
		И ЭтаФорма.ИмяПользователя <> "<Неопределен>" Тогда
		МассивПользователей.Добавить(ЭтаФорма.ИмяПользователя);
		Отбор.Вставить("Пользователь",МассивПользователей);	
	КонецЕсли;
	МассивСеансов.Добавить(Число(ЭтаФорма.Сеанс));
	Отбор.Вставить("Событие",МассивСобытий);	
	Отбор.Вставить("Сеанс",МассивСеансов);
	ТЧДанных = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(ТЧДанных,Отбор);
	Если ТЧДанных.Количество() > 0 Тогда
		Если ТЧДанных.Количество() = 1 Тогда 
			Если ЗначениеЗаполнено(ТЧДанных[0].Данные)Тогда
				Если ТЧДанных[0].Данные.Свойство("Роли") Тогда
					ОтбираемыеРоли = ТЧДанных[0].Данные.Роли;
					Возврат ОтбираемыеРоли; 
				КонецЕсли;
			КонецЕсли;
		Иначе
			ИмяОтбираемогоПользователя = "";
			Для каждого стр Из ЭтаФорма.ТаблицаДанных Цикл
				Если стр.Имя = "Имя" Тогда
					ИмяОтбираемогоПользователя = Стр.Значение;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			Для каждого СобытиеТЧ Из ТЧДанных Цикл
				Если СобытиеТЧ.Данные <> Неопределено Тогда
					Если СобытиеТЧ.Данные.Свойство("Имя") Тогда
						Если  СобытиеТЧ.Данные.Имя = ИмяОтбираемогоПользователя Тогда
							Если СобытиеТЧ.Данные.Свойство("Роли") Тогда
								ОтбираемыеРоли = СобытиеТЧ.Данные.Роли;
								Возврат ОтбираемыеРоли; 
							КонецЕсли;	
							Прервать;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли
			КонецЦикла;		
		КонецЕсли;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура РасшифроватьРолиНаСервере()
	ПолученныеРоли = РасшифроватьРолиСредствами1С();
	Если ЗначениеЗаполнено(ПолученныеРоли) Тогда
		ЭтаФорма.Роли.Очистить();
		Для Каждого ПолученнаяРоль Из ПолученныеРоли Цикл
			НоваяРоль = ЭтаФорма.Роли.Добавить();	
			НоваяРоль.Роль = ПолученнаяРоль;
		КонецЦикла;
		Элементы.РасшифроватьРоли.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьРоли(Команда)
	РасшифроватьРолиНаСервере();
КонецПроцедуры
