
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("АвтоТест") Тогда 
        Возврат;
    КонецЕсли;
    УстановитьУсловноеОформление();
    ОтборЖурналаРегистрации = Новый Структура;
    ОтборЖурналаРегистрацииПоУмолчанию = Новый Структура;
    ЗначенияОтбора = ПолучитьЗначенияОтбораЖурналаРегистрации("Событие").Событие;
    
    Если Не ПустаяСтрока(Параметры.Пользователь) Тогда
        Если ТипЗнч(Параметры.Пользователь) = Тип("СписокЗначений") Тогда
            ОтборПоПользователю = Параметры.Пользователь;
        Иначе
            ИмяПользователя = Параметры.Пользователь;
            ОтборПоПользователю = Новый СписокЗначений;
            ПоПользователю = ОтборПоПользователю.Добавить(ИмяПользователя, ИмяПользователя);
        КонецЕсли;
        ОтборЖурналаРегистрации.Вставить("Пользователь", ОтборПоПользователю);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Параметры.СобытиеЖурналаРегистрации) Тогда
        ОтборПоСобытию = Новый СписокЗначений;
        Если ТипЗнч(Параметры.СобытиеЖурналаРегистрации) = Тип("Массив") Тогда
            Для Каждого Событие Из Параметры.СобытиеЖурналаРегистрации Цикл
                ПредставлениеСобытия = ЗначенияОтбора[Событие];
                ОтборПоСобытию.Добавить(Событие, ПредставлениеСобытия);
            КонецЦикла;
        Иначе
            ОтборПоСобытию.Добавить(Параметры.СобытиеЖурналаРегистрации, Параметры.СобытиеЖурналаРегистрации);
        КонецЕсли;
        ОтборЖурналаРегистрации.Вставить("Событие", ОтборПоСобытию);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
        ОтборЖурналаРегистрации.Вставить("ДатаНачала", Параметры.ДатаНачала);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Параметры.ДатаОкончания) Тогда
        ОтборЖурналаРегистрации.Вставить("ДатаОкончания", Параметры.ДатаОкончания + 1);
    КонецЕсли;
    
    
    Если Параметры.Данные <> Неопределено Тогда
        ОтборЖурналаРегистрации.Вставить("Данные", Параметры.Данные);
    КонецЕсли;
    
    Если Параметры.Сеанс <> Неопределено Тогда
        ОтборЖурналаРегистрации.Вставить("Сеанс", Параметры.Сеанс);
    КонецЕсли;
    
    Если Параметры.Уровень <> Неопределено Тогда
        ОтборЖурналаРегистрации.Вставить("Уровень", Параметры.Уровень);
    КонецЕсли;
    
    
    Если Параметры.ИмяПриложения <> Неопределено Тогда
        СписокПриложений = Новый СписокЗначений;
        Для Каждого Приложение Из Параметры.ИмяПриложения Цикл
            СписокПриложений.Добавить(Приложение, ПредставлениеПриложения(Приложение));
        КонецЦикла;
        ОтборЖурналаРегистрации.Вставить("ИмяПриложения", СписокПриложений);
    КонецЕсли;
    
    КоличествоПоказываемыхСобытий = 200;
    
    ОтборПоУмолчанию = ОтборПоУмолчанию(ЗначенияОтбора);
    Если Не ОтборЖурналаРегистрации.Свойство("Событие") Тогда
        ОтборЖурналаРегистрации.Вставить("Событие", ОтборПоУмолчанию);
    КонецЕсли;
    ОтборЖурналаРегистрацииПоУмолчанию.Вставить("Событие", ОтборПоУмолчанию);
    
    Критичность = "ВсеСобытия";
    
    ЗапускатьНеВФоне    =   Параметры.ЗапускатьНеВФоне;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
    УсловноеОформление.Элементы.Очистить();
    Элемент = УсловноеОформление.Элементы.Добавить();
    ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Данные.Имя);
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Журнал.Данные");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
    Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
    Элемент = УсловноеОформление.Элементы.Добавить();
    ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПредставлениеМетаданных.Имя);
    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Журнал.ПредставлениеМетаданных");
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
    Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
    
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяСервера(СерверЖР)
    Если  СерверЖР                          =   "" Тогда
        Сервер                              =   ХранилищеОбщихНастроек.Загрузить("Журнали2Ст","ИмяСервераЖР");
        Если Сервер                         =   Неопределено Тогда
            СтрокаПодключения               =   ВРег(СтрокаСоединенияИнформационнойБазы());
            Сервер                          =   Лев(СтрокаПодключения,Найти(СтрокаПодключения,""";REF=")-1);    
            Сервер                          =   Прав(Сервер,СтрДлина(Сервер)-6);
            Если    Найти(Сервер,":")       <>  0 Тогда
                Сервер                      =   Лев(Сервер,Найти(Сервер,":")-1);
            КонецЕсли;
        КонецЕсли;
    Иначе 
        Сервер                              =   СерверЖР;
    КонецЕсли;
    ХранилищеОбщихНастроек.Сохранить("Журнали2Ст","ИмяСервераЖР",Сервер);
    Возврат Сервер;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ОбновитьТекущийСписок();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПоказываемыхСобытийПриИзменении(Элемент)
    #Если ВебКлиент Тогда
        КоличествоПоказываемыхСобытий       =   ?(КоличествоПоказываемыхСобытий > 1000, 1000, КоличествоПоказываемыхСобытий);
    #КонецЕсли
    ОбновитьТекущийСписок();
КонецПроцедуры

&НаКлиенте
Процедура КритичностьПриИзменении(Элемент)
    
    Если Критичность = "ВсеСобытия" Тогда
        ОтборЖурналаРегистрации.Удалить("Уровень");
        ОбновитьТекущийСписок();
    ИначеЕсли Критичность = "Ошибки" Тогда
        ОтборПоУровню = Новый СписокЗначений;
        ОтборПоУровню.Добавить("Ошибка", "Ошибка");
        ОтборЖурналаРегистрации.Удалить("Уровень");
        ОтборЖурналаРегистрации.Вставить("Уровень", ОтборПоУровню);
        ОбновитьТекущийСписок();
    ИначеЕсли Критичность = "Предупреждения" Тогда
        ОтборПоУровню = Новый СписокЗначений;
        ОтборПоУровню.Добавить("Предупреждение", "Предупреждение");
        ОтборЖурналаРегистрации.Удалить("Уровень");
        ОтборЖурналаРегистрации.Вставить("Уровень", ОтборПоУровню);
        ОбновитьТекущийСписок();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СобытияВыбор(
    Элементы.Журнал.ТекущиеДанные, 
    Поле, 
    ИнтервалДат, 
    ОтборЖурналаРегистрации);
    
КонецПроцедуры

&НаКлиенте
Процедура СобытияВыбор(ТекущиеДанные, Поле, ИнтервалДат, ОтборЖурналаРегистрации)
    
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если Поле.Имя = "Данные" Или Поле.Имя = "ПредставлениеДанных" Тогда
        Если ТекущиеДанные.Данные <> Неопределено
            И (ТипЗнч(ТекущиеДанные.Данные) <> Тип("Строка")
            И ЗначениеЗаполнено(ТекущиеДанные.Данные)) Тогда
            
            ОткрытьДанныеСобытияДляПросмотра(ТекущиеДанные);
            Возврат;
        КонецЕсли;
    КонецЕсли;
    
    Если Поле.Имя = "Дата" Тогда
        УстановитьИнтервалДатДляПросмотраКлиент(ИнтервалДат, ОтборЖурналаРегистрации);
        Возврат;
    КонецЕсли;
    
    ПросмотрТекущегоСобытияВОтдельномОкнеКлиент(ТекущиеДанные);
    
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрТекущегоСобытияВОтдельномОкнеКлиент(Данные) Экспорт
    
    Если Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    КлючУникальностиФормы = Данные.АдресДанных;
    Попытка
        ОткрытьФорму("ВнешняяОбработка.ЖурналРегистрацииВнешний.Форма.Событие", СобытиеЖурналаРегистрацииВСтруктуру(Данные),, КлючУникальностиФормы);
    Исключение
        Попытка
            ОткрытьФорму("Обработка.ЖурналРегистрацииВнешний.Форма.Событие", СобытиеЖурналаРегистрацииВСтруктуру(Данные),, КлючУникальностиФормы);
        Исключение
            Сообщить("Не могу открыть форму");
        КонецПопытки;
    КонецПопытки;

КонецПроцедуры

&НаКлиенте
Функция СобытиеЖурналаРегистрацииВСтруктуру(Данные)
    
    Если ТипЗнч(Данные) = Тип("Структура") Тогда
        Возврат Данные;
    КонецЕсли;
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Дата",                    Данные.Дата);
    ПараметрыФормы.Вставить("ИмяПользователя",         Данные.ИмяПользователя);
    ПараметрыФормы.Вставить("ПредставлениеПриложения", Данные.ПредставлениеПриложения);
    ПараметрыФормы.Вставить("Компьютер",               Данные.Компьютер);
    ПараметрыФормы.Вставить("Событие",                 Данные.Событие);
    ПараметрыФормы.Вставить("ПредставлениеСобытия",    Данные.ПредставлениеСобытия);
    ПараметрыФормы.Вставить("Комментарий",             Данные.Комментарий);
    ПараметрыФормы.Вставить("ПредставлениеМетаданных", Данные.ПредставлениеМетаданных);
    ПараметрыФормы.Вставить("Данные",                  Данные.Данные);
    ПараметрыФормы.Вставить("ПредставлениеДанных",     Данные.ПредставлениеДанных);
    ПараметрыФормы.Вставить("Транзакция",              Данные.Транзакция);
    ПараметрыФормы.Вставить("СтатусТранзакции",        Данные.СтатусТранзакции);
    ПараметрыФормы.Вставить("Сеанс",                   Данные.Сеанс);
    ПараметрыФормы.Вставить("РабочийСервер",           Данные.РабочийСервер);
    ПараметрыФормы.Вставить("ОсновнойIPПорт",          Данные.ОсновнойIPПорт);
    ПараметрыФормы.Вставить("ВспомогательныйIPПорт",   Данные.ВспомогательныйIPПорт);
    
    Если Данные.Свойство("РазделениеДанныхСеанса") Тогда
        ПараметрыФормы.Вставить("РазделениеДанныхСеанса", Данные.РазделениеДанныхСеанса);
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Данные.АдресДанных) Тогда
        ПараметрыФормы.Вставить("АдресДанных", Данные.АдресДанных);
    КонецЕсли;
    
    Возврат ПараметрыФормы;
КонецФункции

&НаКлиенте
Процедура УстановитьИнтервалДатДляПросмотраКлиент(ИнтервалДат, ОтборЖурналаРегистрации, ОбработчикОповещения = Неопределено) Экспорт
    
    ДатаНачала    = Неопределено;
    ДатаОкончания = Неопределено;
    ОтборЖурналаРегистрации.Свойство("ДатаНачала", ДатаНачала);
    ОтборЖурналаРегистрации.Свойство("ДатаОкончания", ДатаОкончания);
    ДатаНачала    = ?(ТипЗнч(ДатаНачала)    = Тип("Дата"), ДатаНачала, '00010101000000');
    ДатаОкончания = ?(ТипЗнч(ДатаОкончания) = Тип("Дата"), ДатаОкончания, '00010101000000');
    
    Если ИнтервалДат.ДатаНачала <> ДатаНачала Тогда
        ИнтервалДат.ДатаНачала = ДатаНачала;
    КонецЕсли;
    
    Если ИнтервалДат.ДатаОкончания <> ДатаОкончания Тогда
        ИнтервалДат.ДатаОкончания = ДатаОкончания;
    КонецЕсли;
    
    Диалог = Новый ДиалогРедактированияСтандартногоПериода;
    Диалог.Период = ИнтервалДат;
    
    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить("ОтборЖурналаРегистрации", ОтборЖурналаРегистрации);
    ДополнительныеПараметры.Вставить("ИнтервалДат", ИнтервалДат);
    ДополнительныеПараметры.Вставить("ОбработчикОповещения", ОбработчикОповещения);
    
    Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалДатДляПросмотраЗавершение", ЭтаФорма, ДополнительныеПараметры);
    Диалог.Показать(Оповещение);
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеСобытияДляПросмотра(ТекущиеДанные) Экспорт
    
    Если ТекущиеДанные = Неопределено Или ТекущиеДанные.Данные = Неопределено Тогда
        ПоказатьПредупреждение(, НСтр("ru = 'Эта запись журнала регистрации не связана с данными (см. колонку ""Данные"")'"));
        Возврат;
    КонецЕсли;
    
    Попытка
        ПоказатьЗначение(, ТекущиеДанные.Данные);
    Исключение
        ТекстПредупреждения = НСтр("ru = 'Эта запись журнала регистрации связана с данными, но отобразить их невозможно.
        |%1'");
        Если ТекущиеДанные.Событие = "_$Data$_.Delete" Тогда 
            ТекстПредупреждения =
            ПодставитьПараметрыВСтроку(ТекстПредупреждения, НСтр("ru = 'Данные удалены из информационной базы'"));
        Иначе
            ТекстПредупреждения =
            ПодставитьПараметрыВСтроку(ТекстПредупреждения, НСтр("ru = 'Возможно, данные удалены из информационной базы'"));
        КонецЕсли;
        ПоказатьПредупреждение(, ТекстПредупреждения);
    КонецПопытки;
    
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
    Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Событие") Тогда
        Если ВыбранноеЗначение.Событие = "УстановленОтборЖурналаРегистрации" Тогда
            ОтборЖурналаРегистрации.Очистить();
            Для Каждого ЭлементСписка Из ВыбранноеЗначение.Отбор Цикл
                ОтборЖурналаРегистрации.Вставить(ЭлементСписка.Представление, ЭлементСписка.Значение);
            КонецЦикла;
            Если ОтборЖурналаРегистрации.Свойство("Уровень") И ОтборЖурналаРегистрации.Уровень.Количество() > 1 Тогда
                Критичность                 =   "";
            КонецЕсли;
            ОбновитьТекущийСписок();
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийСписок()
    Состояние("Выполняется поиск в журнале регистрации...");
    ПрочитатьЖурнал(ЭтаФорма.СерверЖР);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтбор()
    
    ОтборЖурналаРегистрации = ОтборЖурналаРегистрацииПоУмолчанию;
    Критичность = "ВсеСобытия";
    ОбновитьТекущийСписок();
    
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеДляПросмотра()
    
    ТекДанные = Элементы.Журнал.ТекущиеДанные;
    
    Если ТекДанные = Неопределено Или ТекДанные.Данные = Неопределено Тогда
        ПоказатьПредупреждение(, НСтр("ru = 'Эта запись журнала регистрации не связана с данными (см. колонку ""Данные"")'"));
        Возврат;
    КонецЕсли;
    
    Попытка
        ПоказатьЗначение(, ТекДанные.Данные);
    Исключение
        ТекстПредупреждения = НСтр("ru = 'Эта запись журнала регистрации связана с данными, но отобразить их невозможно.
        |%1'");
        Если ТекДанные.Событие = "_$Data$_.Delete" Тогда 
            ТекстПредупреждения =
            ПодставитьПараметрыВСтроку(ТекстПредупреждения, НСтр("ru = 'Данные удалены из информационной базы'"));
        Иначе
            ТекстПредупреждения =
            ПодставитьПараметрыВСтроку(ТекстПредупреждения, НСтр("ru = 'Возможно, данные удалены из информационной базы'"));
        КонецЕсли;
        ПоказатьПредупреждение(, ТекстПредупреждения);
    КонецПопытки;
    
    
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрТекущегоСобытияВОтдельномОкне()
    
    ПросмотрТекущегоСобытияВОтдельномОкнеКлиент(Элементы.Журнал.ТекущиеДанные);
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалДатДляПросмотра()
    
    Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалДатДляПросмотраЗавершение", ЭтаФорма);
    УстановитьИнтервалДатДляПросмотраКлиент(ИнтервалДат, ОтборЖурналаРегистрации, Оповещение)
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор()
    
    УстановитьОтборНаКлиенте();
    
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОтбораНажатие(Элемент, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    УстановитьОтборНаКлиенте();
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоЗначениюВТекущейКолонке()
    
    КолонкиИсключения = Новый Массив;
    КолонкиИсключения.Добавить("Дата");
    
    Если УстановитьОтборПоЗначениюВТекущейКолонкеКлиент(
        Элементы.Журнал.ТекущиеДанные,
        Элементы.Журнал.ТекущийЭлемент,
        ОтборЖурналаРегистрации,
        КолонкиИсключения) Тогда
        
        ОбновитьТекущийСписок();
        
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Функция УстановитьОтборПоЗначениюВТекущейКолонкеКлиент(ТекущиеДанные, ТекущийЭлемент, ОтборЖурналаРегистрации, КолонкиИсключения) 
    
    Если ТекущиеДанные = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    
    ИмяКолонкиПредставления = ТекущийЭлемент.Имя;
    
    Если ИмяКолонкиПредставления = "ПредставлениеРазделенияДанныхСеанса" Тогда
        ОтборЖурналаРегистрации.Удалить("ПредставлениеРазделенияДанныхСеанса");
        ОтборЖурналаРегистрации.Вставить("РазделениеДанныхСеанса", ТекущиеДанные.РазделениеДанныхСеанса);
        ИмяКолонкиПредставления = "РазделениеДанныхСеанса";
    КонецЕсли;
    
    Если КолонкиИсключения.Найти(ИмяКолонкиПредставления) <> Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;
    ЗначениеОтбора = ТекущиеДанные[ИмяКолонкиПредставления];
    Представление  = ТекущиеДанные[ИмяКолонкиПредставления];
    
    ИмяЭлементаОтбора = ИмяКолонкиПредставления;
    Если ИмяКолонкиПредставления = "ИмяПользователя" Тогда 
        ИмяЭлементаОтбора = "Пользователь";
        ЗначениеОтбора = ТекущиеДанные["Пользователь"];
    ИначеЕсли ИмяКолонкиПредставления = "ПредставлениеПриложения" Тогда
        ИмяЭлементаОтбора = "ИмяПриложения";
        ЗначениеОтбора = ТекущиеДанные["ИмяПриложения"];
    ИначеЕсли ИмяКолонкиПредставления = "ПредставлениеСобытия" Тогда
        ИмяЭлементаОтбора = "Событие";
        ЗначениеОтбора = ТекущиеДанные["Событие"];
    КонецЕсли;
    
    
    Если ТипЗнч(ЗначениеОтбора) = Тип("Строка") И ПустаяСтрока(ЗначениеОтбора) Тогда
        
        Если ИмяКолонкиПредставления <> "ИмяПользователя" Тогда 
            Возврат Ложь;
        КонецЕсли;
    КонецЕсли;
    
    ТекущееЗначение = Неопределено;
    Если ОтборЖурналаРегистрации.Свойство(ИмяЭлементаОтбора, ТекущееЗначение) Тогда
        ОтборЖурналаРегистрации.Удалить(ИмяЭлементаОтбора);
    КонецЕсли;
    
    Если ИмяЭлементаОтбора = "Данные" Тогда
        
        ТипЭлементаОтбора = Строка(ТипЗнч(ЗначениеОтбора));
        Если ВРег(ТипЭлементаОтбора) <> "БУЛЕВО" 
            И ВРег(ТипЭлементаОтбора) <> "СТРОКА" 
            И ВРег(ТипЭлементаОтбора) <> "ДАТА"  Тогда
            ОтборЖурналаРегистрации.Вставить(ИмяЭлементаОтбора, ЗначениеОтбора);
            Возврат Истина;
        Иначе
            Возврат Ложь;    
        КонецЕсли;    
    КонецЕсли;    
    
    Если ИмяЭлементаОтбора = "Комментарий"
        Или ИмяЭлементаОтбора = "Транзакция"
        Или ИмяЭлементаОтбора = "ПредставлениеДанных" Тогда
        ОтборЖурналаРегистрации.Вставить(ИмяЭлементаОтбора, ЗначениеОтбора);
    Иначе
        
        Если ИмяЭлементаОтбора = "РазделениеДанныхСеанса" Тогда
            СписокОтбора = ЗначениеОтбора.Скопировать();
        Иначе
            СписокОтбора = Новый СписокЗначений;
            СписокОтбора.Добавить(ЗначениеОтбора, Представление);
        КонецЕсли;
        
        ОтборЖурналаРегистрации.Вставить(ИмяЭлементаОтбора, СписокОтбора);
    КонецЕсли;
    
    Возврат Истина;
    
КонецФункции

&НаКлиенте
Процедура УстановитьИнтервалДатДляПросмотраЗавершение(ИнтервалУстановлен, ДополнительныеПараметры) Экспорт
    
    Если  ЗначениеЗаполнено(ИнтервалУстановлен) Тогда
        ОтборЖурналаРегистрации.Вставить("ДатаНачала", ИнтервалУстановлен.ДатаНачала);
        ОтборЖурналаРегистрации.Вставить("ДатаОкончания", ИнтервалУстановлен.ДатаОкончания);
        ОбновитьТекущийСписок();
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ОтборПоУмолчанию(СписокСобытий)
    
    ОтборПоУмолчанию = Новый СписокЗначений;
    
    Для Каждого СобытиеЖурнала Из СписокСобытий Цикл
        
        Если СобытиеЖурнала.Ключ = "_$Transaction$_.Commit"
            Или СобытиеЖурнала.Ключ = "_$Transaction$_.Begin"
            Или СобытиеЖурнала.Ключ = "_$Transaction$_.Rollback" Тогда
            Продолжить;
        КонецЕсли;
        
        ОтборПоУмолчанию.Добавить(СобытиеЖурнала.Ключ, СобытиеЖурнала.Значение);
        
    КонецЦикла;
    
    Возврат ОтборПоУмолчанию;
КонецФункции

&НаСервере
Функция ПрочитатьЖурнал(СерверЖР)
    ОбработкаОбъект                         =   РеквизитФормыВЗначение("ЖурналРегистрацииВнешний");
    ПараметрыОтчета                         =   ПараметрыОтчета();
    ОбработкаОбъект.СерверЖР                =   ПолучитьИмяСервера(СерверЖР);
    Результат                               =   ОбработкаОбъект.ПрочитатьСобытияЖурналаРегистрации(ПараметрыОтчета,ОбработкаОбъект.СерверЖР);
    ОбработкаОбъект.СформироватьПредставлениеОтбора(ПредставлениеОтбора, ОтборЖурналаРегистрации, ОтборЖурналаРегистрацииПоУмолчанию);
    СобытияЖурнала                          =   Результат.СобытияЖурнала;
    ЗначениеВДанныеФормы(СобытияЖурнала, Журнал);
    КоличествоСобытий                       =   ОбработкаОбъект.КолвоСобытий;
    СерверЖР                                =   ОбработкаОбъект.СерверЖР;
    ИндикаторИндекса                        =   ОбработкаОбъект.Процент;
КонецФункции

&НаСервере
Функция ПараметрыОтчета()
    ПараметрыОтчета = Новый Структура;
    ПараметрыОтчета.Вставить("ОтборЖурналаРегистрации", ОтборЖурналаРегистрации);
    ПараметрыОтчета.Вставить("КоличествоПоказываемыхСобытий", КоличествоПоказываемыхСобытий);
    ПараметрыОтчета.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
    ПараметрыОтчета.Вставить("МенеджерВладельца", ЭтаФорма);
    ПараметрыОтчета.Вставить("ДобавлятьДополнительныеКолонки", Ложь);
    ПараметрыОтчета.Вставить("Журнал", РеквизитФормыВЗначение("Журнал"));
    
    Возврат ПараметрыОтчета;
КонецФункции

&НаКлиенте
Процедура УстановитьОтборНаКлиенте()
    ОтборФормы = Новый СписокЗначений;
    Для Каждого КлючИЗначение Из ОтборЖурналаРегистрации Цикл
        ОтборФормы.Добавить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
    КонецЦикла;
    Попытка
        ОткрытьФорму(
                        "ВнешняяОбработка.ЖурналРегистрацииВнешний.Форма.ОтборЖурналаРегистрации",
                        Новый Структура("Отбор, СобытияПоУмолчанию", ОтборФормы, ОтборЖурналаРегистрацииПоУмолчанию.Событие), 
                        ЭтаФорма
                     );
    Исключение
        Попытка
            ОткрытьФорму(
                        "Обработка.ЖурналРегистрацииВнешний.Форма.ОтборЖурналаРегистрации",
                        Новый Структура("Отбор, СобытияПоУмолчанию", ОтборФормы, ОтборЖурналаРегистрацииПоУмолчанию.Событие), 
                        ЭтаФорма
                        );
        Исключение
            Сообщить("Не могу открыть форму");
        КонецПопытки;
    КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
    Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
    Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
    Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
    
    ИспользоватьАльтернативныйАлгоритм = 
    Найти(Параметр1, "%")
    Или Найти(Параметр2, "%")
    Или Найти(Параметр3, "%")
    Или Найти(Параметр4, "%")
    Или Найти(Параметр5, "%")
    Или Найти(Параметр6, "%")
    Или Найти(Параметр7, "%")
    Или Найти(Параметр8, "%")
    Или Найти(Параметр9, "%");
    
    Если ИспользоватьАльтернативныйАлгоритм Тогда
        СтрокаПодстановки = ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(СтрокаПодстановки, Параметр1,
        Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
    Иначе
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
        СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
    КонецЕсли;
    
    Возврат СтрокаПодстановки;
КонецФункции

&НаКлиенте
Функция ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(   
                                                            Знач СтрокаПодстановки,
                                                            Знач Параметр1, 
                                                            Знач Параметр2 = Неопределено, 
                                                            Знач Параметр3 = Неопределено,
                                                            Знач Параметр4 = Неопределено, 
                                                            Знач Параметр5 = Неопределено, 
                                                            Знач Параметр6 = Неопределено,
                                                            Знач Параметр7 = Неопределено, 
                                                            Знач Параметр8 = Неопределено, 
                                                            Знач Параметр9 = Неопределено
                                                        )
    Результат                           =   "";
    Позиция                             =   Найти(СтрокаПодстановки, "%");
    Пока Позиция                        >   0 Цикл 
        Результат                       =   Результат + Лев(СтрокаПодстановки, Позиция - 1);
        СимволПослеПроцента             =   Сред(СтрокаПодстановки, Позиция + 1, 1);
        ПодставляемыйПараметр           =   "";
        Если СимволПослеПроцента        =   "1" Тогда
            ПодставляемыйПараметр       =   Параметр1;
        ИначеЕсли СимволПослеПроцента   =   "2" Тогда
            ПодставляемыйПараметр       =   Параметр2;
        ИначеЕсли СимволПослеПроцента   =   "3" Тогда
            ПодставляемыйПараметр       =   Параметр3;
        ИначеЕсли СимволПослеПроцента   =   "4" Тогда
            ПодставляемыйПараметр       =   Параметр4;
        ИначеЕсли СимволПослеПроцента   =   "5" Тогда
            ПодставляемыйПараметр       =   Параметр5;
        ИначеЕсли СимволПослеПроцента   =   "6" Тогда
            ПодставляемыйПараметр       =   Параметр6;
        ИначеЕсли СимволПослеПроцента   =   "7" Тогда
            ПодставляемыйПараметр       =   Параметр7
        ИначеЕсли СимволПослеПроцента   =   "8" Тогда
            ПодставляемыйПараметр       =   Параметр8;
        ИначеЕсли СимволПослеПроцента   =   "9" Тогда
            ПодставляемыйПараметр       =   Параметр9;
        КонецЕсли;
        Если ПодставляемыйПараметр      =   "" Тогда
            Результат                   =   Результат + "%";
            СтрокаПодстановки           =   Сред(СтрокаПодстановки, Позиция + 1);
        Иначе
            Результат                   =   Результат + ПодставляемыйПараметр;
            СтрокаПодстановки           =   Сред(СтрокаПодстановки, Позиция + 2);
        КонецЕсли;
        Позиция                         =   Найти(СтрокаПодстановки, "%");
    КонецЦикла;
    Результат                           =   Результат + СтрокаПодстановки;
    Возврат Результат;
КонецФункции


